/*
 * Function: 0x803245fc
 * ROM Offset: 0x002255fc
 * Category: general
 * Auto-decompiled
 */

// Decompiled C code
int fcn.803245fc (int esi, int edx) {
}

/*
// Full analysis output
[38;2;58;150;221m┌[0m 8: [38;2;197;15;31mfcn.803245fc[0m ();
[38;2;58;150;221m│[0m           [38;2;19;161;14m0x803245fc[0m      [38;2;204;204;204m03[38;2;204;204;204me0[38;2;19;161;14m00[38;2;204;204;204m08[0m       [38;2;197;15;31mjr ra[0m[0m
[38;2;58;150;221m└[0m           [38;2;19;161;14m0x80324600[0m      [38;2;19;161;14m00[38;2;19;161;14m00[38;2;19;161;14m00[38;2;19;161;14m00[0m       [38;2;0;55;218mnop[0m[0m[0m
int fcn.803245fc (int esi, int edx) {
    loc_0x803245fc:
        ret
        0x80324600
         // (break)
}

*/
